#include <stdio.h>
int main()
{
	//سوال دوم: اصغر بازیگوش
	int i = 1;
	float h, b, w;
	scanf_s("%f %f %f", &h, &b, &w);//وارد کردن ارتفاع تا پشت بام و ضریب ثابت و ارتفاع تا پنجره
	if (h <= 0 || b >= 1 || b <= 0 || w >= h)//بررسی ورودی ها برای تشخیص مجاز یا غیر مجاز بودن
	{
		printf("-1");//ورودی اشتباه
	}
	else
	{
		while (w < h * b)
		{
			h = h * b;//ارتفاع بالا آمدن توپ بعد از هر برخورد با زمین
			i += 2;//شمارش تعداد دفعات دیده شدن توپ
		}
		printf("%d", i);//تعداد دفعاتی که توپ دیده شده است
	}


}