#include <stdio.h>
int main()
{//سوال اول: کلاه قرمزی
	int n, m = 10, i = 0;
	int ten = 0, twenty = 0;
	scanf_s("%d", &n);//Enter the number of poeple in the queue
	if (n >= 1)
	{
		i = 2;
		while (n >= 1)
		{
			scanf_s("%d", &m);//Enter the money in the queue
			if (m == 10 || m == 20 || m == 40)
			{
				if (m == 10)//اگر این نفر اسکناس 10تایی داشت
				{
					ten++;
				}
				if (m == 20)//اگر این نفر اسکناس 20تایی داشت
				{
					ten--;//تعداد اسکناسهای 10تایی بعداز بازگرداندن باقی پول
					twenty++;//تعداد اسکناسهای 20تایی
					if (ten < 0)//اگر در بازگردانی پول اسکناس 10تایی کم اومد
					{
						i = 1;
					}
				}
				if (m == 40)//اگر این نفر اسکناس 40تایی داشت
				{
					if (ten >= 1 && twenty >= 1)//اگر اسکناس 10تایی و 20تایی داشتیم با اون باقی پول او را میدهیم
					{
						ten--;
						twenty--;
						//تعداد اسکناسهای 10تایی و 20تایی بعداز بازگرداندن اقی پول
					}
					else
					{
						if (ten >= 3)//اگر اسکناس 20تایی نداشتیم جای آن 3تا 10تایی بده
						{
							ten -= 3;
						}
						else
						{
							i = 1;//درصورتی که در بازگردانی باقی پول دچار کمبود اسکناس شدیم
						}
					}
				}
			}
			else
			{
				printf("The amount of money is unacceptable!");
				i = 3;
				break;
			}
			n--;//برو نفر بعدی
		}
	}
	if (i == 1)//اگر در بازگردانی باقی پول دچار کمبود اسکناس شده بودیم
		printf("No");
	else if(i == 2)
	{
		printf("Yes");
	}
	else if (i == 0)//ورودی غیر مجاز کاراکتر
	{
		printf("input (n) is incorrect!");
	}
}